# Day 5: Aggregate Functions and GROUP BY üéâ

Today we explore summarizing data using functions like `COUNT`, `SUM`, `AVG`, `MIN`, `MAX` and the `GROUP BY` clause.

### 1. Database Connection

In [1]:
import mysql.connector
import pandas as pd

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="sql_30days_challenge"
)
cursor = conn.cursor()
print("Connected to 'sql_30days_challenge'!")

Connected to 'sql_30days_challenge'!

---

## Practice Exercises üìù

### 1. Total number of students in each course
(We'll add a `course` column to students and update data)

In [2]:
try:
    cursor.execute("ALTER TABLE students ADD COLUMN course VARCHAR(50)")
except:
    pass

cursor.execute("UPDATE students SET course = 'SQL' WHERE student_id = 101")
cursor.execute("UPDATE students SET course = 'Python' WHERE student_id = 102")
cursor.execute("UPDATE students SET course = 'SQL' WHERE student_id = 103")
conn.commit()

query = "SELECT course, COUNT(*) AS student_count FROM students GROUP BY course"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_18360\1763510748.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   course  student_count
0  Python              1
1     SQL              2

### 2. Average salary of employees in each department

In [3]:
query = "SELECT department, AVG(salary) AS average_salary FROM employees GROUP BY department"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_18360\2178544523.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

  department  average_salary
0         HR         50000.0
1         IT         65000.0
2  Marketing         50000.0

### 3. Minimum and maximum price of products in each category
(We'll add a `category` column to products)

In [4]:
try:
    cursor.execute("ALTER TABLE products ADD COLUMN category VARCHAR(50)")
except:
    pass

cursor.execute("UPDATE products SET category = 'Electronics' WHERE product_id IN (1, 4)")
cursor.execute("UPDATE products SET category = 'Accessories' WHERE product_id IN (2, 3, 5)")
conn.commit()

query = "SELECT category, MIN(price) AS min_price, MAX(price) AS max_price FROM products GROUP BY category"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_18360\2749983125.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

      category  min_price  max_price
0  Accessories       10.0       75.0
1  Electronics      200.0     1200.0

### 4. Count the number of orders placed by each customer
(First, create the `orders` table)

In [5]:
cursor.execute("DROP TABLE IF EXISTS orders")
cursor.execute('''
CREATE TABLE orders (
    order_id INT PRIMARY KEY,
    customer_id INT,
    order_date DATE,
    order_total DECIMAL(10, 2)
)
''')

orders_data = [
    (1, 101, '2023-10-01', 150.00),
    (2, 102, '2023-10-02', 200.00),
    (3, 101, '2023-10-03', 50.00),
    (4, 103, '2023-10-04', 300.00),
    (5, 102, '2023-10-05', 100.00)
]
cursor.executemany("INSERT INTO orders VALUES (%s, %s, %s, %s)", orders_data)
conn.commit()

query = "SELECT customer_id, COUNT(*) AS order_count FROM orders GROUP BY customer_id"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_18360\893205968.py:22: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   customer_id  order_count
0          101            2
1          102            2
2          103            1

In [6]:
conn.close()